Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.4.5.71");
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");    
	ПараметрыРегистрации.Вставить("Наименование", Метаданные().Синоним);
	ПараметрыРегистрации.Вставить("Версия", Метаданные().Комментарий);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", Метаданные().Синоним + " " + Метаданные().Комментарий);
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление=НСтр("ru = 'Загрузка всей номенклатуры'");
	НоваяКоманда.Идентификатор="ЗагрузкаВсейНоменклатуры";
	НоваяКоманда.Использование="ВызовСерверногоМетода";
	НоваяКоманда.ПоказыватьОповещение=Истина;
	НоваяКоманда.Модификатор="";
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление=НСтр("ru = 'Загрузка измененной номенклатуры'");
	НоваяКоманда.Идентификатор="ЗагрузкаИзмененнойНоменклатуры";
	НоваяКоманда.Использование="ВызовСерверногоМетода";
	НоваяКоманда.ПоказыватьОповещение=Истина;
	НоваяКоманда.Модификатор="";

	Возврат ПараметрыРегистрации;
	
КонецФункции   

Процедура ВыполнитьКоманду(Идентификатор, ОбъектыНазначения) Экспорт        
	Если Идентификатор = "ЗагрузкаВсейНоменклатуры" Тогда
		ЗагрузкаВсейНоменклатуры();
	ИначеЕсли Идентификатор = "ЗагрузкаИзмененнойНоменклатуры" Тогда
	КонецЕсли		
КонецПроцедуры

Процедура ЗагрузкаВсейНоменклатуры()
	
	Перем ДатаФайла, ИмяФайла, ОбработкаОбмена, Разница, СекундВСутках;
	
	ИмяФайла = "\\wdmycloud\Public\Goods_AAtoKEDO.xml";
	ДатаФайла = ПолучитьДатуФайла(ИмяФайла);
	
	ЗаписьЖурналаРегистрации("Обмен с АА", УровеньЖурналаРегистрации.Информация,,, 
	"Начало загрузки номенклатуры из АА от: " + Формат(ДатаФайла,"ДЛФ=DDT"));
	
	Разница = ТекущаяДата() - ДатаФайла;
	СекундВСутках = 86400;
	Если Разница > СекундВСутках Тогда 
		ЗаписьЖурналаРегистрации("Обмен с АА", УровеньЖурналаРегистрации.Ошибка,,, 
		"Файл с номенклатурой из АА не загружен - слишком старый, более суток: " + Формат(ДатаФайла,"ДЛФ=DDT"));
	Иначе	
		ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
		ОбработкаОбмена.ИмяФайлаОбмена = ИмяФайла;
		ОбработкаОбмена.РежимОбмена = "Загрузка";
		ОбработкаОбмена.ОткрытьФайлЗагрузки(Истина);
		ОбработкаОбмена.АрхивироватьФайл = Ложь;;
		ОбработкаОбмена.ВыполнитьЗагрузку();
		ОбработкаОбмена = Неопределено;      
		
		ЗаписьЖурналаРегистрации("Обмен с АА. Полная загрузка.", УровеньЖурналаРегистрации.Информация,,, 
		"Загружена номенклатура из АА от: " + Формат(ДатаФайла,"ДЛФ=DDT"));
	КонецЕсли;

КонецПроцедуры


Функция ПолучитьДатуФайла(Знач ИмяФайла) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.ПолучитьВремяИзменения();
	 
КонецФункции